* Notes
- lagrange interpolation
- vector adition and polynomial addition are homomorphic, up to the Lagrange interpolation
 - what follows is that vector by scalar multiplication is also homomorphic to the Lagrange polynomial by scalar multiplication.
- schwartz-zippel lemma
- QAP: $Lv \odot Rv \equiv Ov$

#+BEGIN_SRC sage :session . :exports both
import numpy as np

FR = RationalField()
R.<x> = PolynomialRing(FR)

xs = [1,2,3]
u = [2,4,8]
v = [4,2,8]

ux = R.lagrange_polynomial(zip(xs,u))
vx = R.lagrange_polynomial(zip(xs,v))

# product of polynomials that interpolate both vectors
p1 = ux * vx

# polynomial that interpolates the hadamard vector product
p2 = R.lagrange_polynomial(zip(xs,np.multiply(u,v)))

# TODO: find points of intersection
#p1.intersection(p2)

p = (p2-p1)
p.roots()

#+END_SRC

#+RESULTS:
: [(3, 1), (2, 1), (1, 1), (-3/2, 1)]
